import os
import pandas as pd

from visdatcompy.common.hash import Hash
from visdatcompy.common.sift import SIFT
from visdatcompy.common.metrics import Metrics
from visdatcompy.common.image_handler import Image, Dataset


# ==================================================================================================================================
# |                                                            COMPARISON                                                          |
# ==================================================================================================================================


def compare(dataset1: Dataset, dataset2: Dataset):

    # 1. Получение метаданных, сравнение по ним, нахождение полных дублей
    dataset1.get_exif_data()
    dataset2.get_exif_data()

    # 2. Метрики???
    # 3. ХЭШИ, ORB, FAST.


"""
 _________________________________________________________________________________________________________________
|                                                                                                                 |
|                                           ЛОГИКА РАБОТЫ ГЛАВНОЙ ФУНКЦИИ:                                        |
|                                                                                                                 |
| 1. Сравнение по exif-данным.                                                                                    |
| 1.1. С помощью get_exif_data(image_path) получаем exif-данные нашей первой фотки. (ПРЕОБРАЗОВАТЬ В DATAFRAME)   |
| 1.2. С помощью create_exif_dataframe(dataset_path) получаем exif-данные всех изображений. (УЖЕ DATAFRAME)       |
| 1.3. Сравниваем exif-данные фотки с другими изображениями для поиска дублей.                                    |
| 2. Сравнение Pix2Pix.                                                                                           |
| 3. Сравнение по метрикам.                                                                                       |
|                                                                                                                 |
| Returns: таблица схожести.                                                                                      |
|                                                                                                                 |
|_________________________________________________________________________________________________________________|
"""
